{
    "1": {
      "id": "1",
      "title_chinese": "大學",
      "title": "Da Xue (The Great Learning)",
      "author_chinese": "先秦及漢代儒家",
      "author": "Pre-Qin and Han Confucian Scholars",
      "content": "大學之道 在明明德 在親民 在止於至善。知止而后有定 定而后能靜 靜而后能安 安而后能慮 慮而后能得。物有本末 事有終始 知所先後 則近道矣。古之欲明明德於天下者 先治其國 欲治其國者 先齊其家 欲齊其家者 先修其身 欲修其身者 先正其心 欲正其心者 先誠其意 欲誠其意者 先致其知 致知在格物。物格而後知至 知至而後意誠 意誠而後心正 心正而後身修 身修而後家齊 家齊而後國治 國治而後天下平。",
      "translation_english": "The path of the Great Learning lies in shining forth our innate virtue, guiding others kindly, and resting in ultimate goodness. When you know your proper endpoint, your mind finds firmness; with firmness comes stillness, with stillness comes calm, with calm you can reflect, and through reflection, you reach understanding. All things have roots and branches, all affairs have a start and a finish; by knowing what should come first and what after, you move closer to the Way. In ancient times, those who wished to bring out bright virtue in the world first governed their own states well. To govern their states, they first brought harmony to their families. To harmonize their families, they first refined themselves. To refine themselves, they straightened out their hearts. To straighten their hearts, they made their intentions sincere. To make their intentions sincere, they pursued true knowledge, which rests in understanding the nature of things. When things are understood, knowledge is complete; with knowledge complete, intentions become sincere; with sincere intentions, the heart is upright; with an upright heart, the self is cultivated; with the self cultivated, the family is well-ordered; with the family ordered, the state is well-governed; and with the state governed, the world finds peace."
    },
    "181": {
      "id": "181",
      "title_chinese": "吾有十畝田",
      "title": "I Have Ten Acres of Fields",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "吾有十畝田 種在南山坡。青松四五樹 綠豆兩三窠。熱即池中浴 涼便岸上歌。遨游自取足 誰能柰我何。",
      "translation_english": "I’ve got ten acres planted on the southern slopes, a few green pines, a couple plots of green beans. When it’s hot, I bathe in the pond; when it’s cool, I sing by the bank. I wander freely, satisfied on my own terms. Who can do anything about it?"
    },
    "182": {
      "id": "182",
      "title_chinese": "人去像還去",
      "title": "People Depart, The Reflection Still Remains",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "人去像還去 人來像以明。像有投鏡意 人無合像情。鏡像俱磨滅 何處有眾生？",
      "translation_english": "When people depart, their reflection also slips away; when people arrive, the reflection grows clear. The image strives to enter the mirror, but people feel no unity with that image. Eventually, mirror and image both fade, leaving nowhere for any being to be found."
    },
    "183": {
      "id": "183",
      "title_chinese": "一身元本別",
      "title": "Our Body’s Elements Are Originally Separate",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "一身元本別 四大聚會同。直似風吹火 還如火逐風。火強風熾疾 風疾火愈烘。火風俱氣盡 星散惣成空。",
      "translation_english": "This body was never one to begin with; the four elements merely gathered together. They’re like wind stirring fire, or fire chasing after wind. As the fire grows fiercer, the wind blows stronger; as the wind speeds up, the fire blazes hotter. Then both fire and wind run out of breath, the sparks scatter into emptiness."
    },
    "184": {
      "id": "184",
      "title_chinese": "以影觀他影",
      "title": "Watching Others’ Shadows With Your Own",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "以影觀他影 以身觀我身。身影何處暱 身共影何親。身行影作伴 身住影為鄰。身影百年外 相看一聚塵。",
      "translation_english": "You see others’ shadows through your own shadow, and measure yourself by your body. Where can the body find refuge with its shadow? How are body and shadow even kin? When the body moves, the shadow tags along; when the body stays, the shadow’s a neighbor. Beyond a hundred years, body and shadow both crumble into dust."
    },
    "185": {
      "id": "185",
      "title_chinese": "觀影元非有",
      "title": "Observing The Shadow Shows It’s Not Real",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "觀影元非有 觀身亦是空。如採水底月 似捉樹頭風。攬之不可見 尋之不可窮。眾生隨業轉 恰似寐夢中。",
      "translation_english": "Look at the shadow: it never truly existed. Look at the body: it’s also empty. Trying to grasp it is like reaching for the moon’s reflection in the water, or snatching the wind at treetop level. You can’t hold it, can’t chase it down. All beings follow their karma, like drifting through a dream."
    },
    "186": {
      "id": "186",
      "title_chinese": "雷發南山上",
      "title": "Thunder Rolls on South Mountain",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "雷發南山上 雨落北溪中。雷驚礰火 雨激咆哮風。倏忽威靈歇 須臾勢力窮。天地不能已 如女為身空。",
      "translation_english": "Thunder booms atop South Mountain, while rain falls into the northern creek. The thunder startles like sparks of stone, rain stirs a howling wind. In a flash, that mighty force rests; in a moment, its power is spent. Heaven and earth can’t hold on forever—like a woman’s hollowed form, emptiness remains."
    },
    "187": {
      "id": "187",
      "title_chinese": "非相非非相",
      "title": "Not Form, Not Non-Form",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "非相非非相 旡明旡旡明。相逐妄中出 明從暗裏生。明通暗即盡 妄絕相還清。能知寂滅樂 自然無色聲。",
      "translation_english": "Not form, not no-form; not brightness, not no-brightness. Form chases illusions into being, brightness emerges from the dark. Let brightness penetrate, and darkness disappears. Let delusions cease, and form returns pure. Those who know the silent joy of cessation find a natural state with no color, no sound."
    },
    "1881": {
      "id": "188",
      "title_chinese": "但看繭作蛾",
      "title": "Just Watch the Cocoon Turn to a Moth",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "但看繭作蛾 不憶蠶生箔。但看睡寐時 還將夢為樂。蛾既不羨蠶 夢亦不為樂。當作如是觀 死生無好惡。",
      "translation_english": "Just watch a cocoon turn into a moth, it never remembers the silkworm’s old bed of straw. As we watch ourselves sleep, we treat dreams as joy. But the moth never envies the silkworm, and dreams don’t hold true delight. Consider it this way: in death and life, there’s no good or bad."
    },
    "1891": {
      "id": "189",
      "title_chinese": "黃母化為鱉",
      "title": "Yellow Mother Turns Into a Turtle",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "黃母化為鱉 秖為鱉為身。牛哀化為虎 亦是虎為人。不憶當時業 寧知過去因？死生一變化 若個是師親？",
      "translation_english": "The Yellow Mother turns into a turtle, just a turtle as its own form. The mournful ox becomes a tiger, and that tiger becomes a man. No one recalls their old karma, who can know the past causes? Life and death are one big change—who is truly master or kin?"
    },
    "1901": {
      "id": "190",
      "title_chinese": "古來服丹石",
      "title": "In Ancient Times They Took Elixirs",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "古來服丹石 相次入黃泉。萬寶不贖命 千金不買年。有生即有死 何後複何先。人人惣色活 拄著上頭天。",
      "translation_english": "In olden days they swallowed cinnabar and minerals, only to line up at the Yellow Springs. No mountain of treasure can ransom life, no fortune can buy more years. Where there’s birth, there’s death—no one’s behind, no one’s ahead. Everyone lives, putting their heads up against the sky."
    },
    "188": {
      "id": "b7e9df89-dff4-4d29-8d94-88d456e72d6e",
      "title_chinese": "但看繭作蛾",
      "title": "Just Watch the Cocoon Turn to a Moth",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "但看繭作蛾 不憶蠶生箔。但看睡寐時 還將夢為樂。蛾既不羨蠶 夢亦不為樂。當作如是觀 死生無好惡。",
      "translation_english": "Just watch a cocoon become a moth; it never recalls the silkworm’s bed. We watch ourselves sleeping, mistaking dreams for joy. The moth does not envy the worm, and dreams are not true delight. See things this way: life and death have no preference."
    },
    "189": {
      "id": "f9b1e2e5-87df-46d6-b83e-c42ad1d77ba8",
      "title_chinese": "遙看世間人",
      "title": "Gazing from Afar at People in the World",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "遙看世間人 村坊安社邑。一家有死生 合村相就泣。張口哭他尸 不知身去急。本是長眠鬼 蹔來地上立。欲似養兒氈 回乾且就濕。前死深埋卻 後死續即入。",
      "translation_english": "From afar, I see people in their village homes. When one family faces death and birth, the whole village gathers to weep. They open their mouths, wailing over a corpse, unaware how soon their own turn will come. We’re all just ghosts due for a long sleep, briefly standing on earth. They try to care for their children like spreading a blanket—turning it from dry to damp. One dies and is buried deep, the next dies and takes their place."
    },
    "190": {
      "id": "ba81d91e-8897-4d14-84b9-927ef91c4fb0",
      "title_chinese": "吾富有錢時",
      "title": "When I Was Rich",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "吾富有錢時 婦兒看我好。吾若脫衣裳 與吾迭袍襖。吾出經求去 送吾即上道。將錢入舍來 見吾滿面笑。繞吾白鴿旋 恰似鸚鵡鳥。",
      "translation_english": "When I was loaded with cash, my wife and children adored me. If I took off my robe, they rushed to give me a fine jacket. If I went out to find a scripture, they’d walk me right to the gate. When I brought money home, they grinned at me ear to ear, circling me like doves, like parrots delighting in pretty words."
    },
    "191": {
      "id": "d3be8890-6314-4349-bbb7-3255e5c56f37",
      "title_chinese": "家口惣死盡",
      "title": "All My Family Have Died",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "家口惣死盡 吾死無親表。急首賣資產 與設逆修齋。托生得好處 身死雇人埋。錢遣鄰保出 任你自相差。",
      "translation_english": "All my kin have passed away, so when I die, I have no close relatives. In haste, I sell off my goods and hold funeral rites against the grain. Reborn somewhere better, after death I’ll hire someone to bury me. I’ll hand money to neighbors to sort things out on their own."
    },
    "192": {
      "id": "a9be2f82-4b91-4c6b-9cb2-9c1499f39d87",
      "title_chinese": "身如圈裡羊",
      "title": "This Body Is Like a Sheep in a Pen",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "身如圈裡羊 命報恰相當。羊即披毛走 人著好衣裳。脫衣赤體立 形段不如羊。羊即日日死 人還日日亡。",
      "translation_english": "The body’s like a sheep penned in a corral, fated to what must come. A sheep grows its wool; we wear fancy clothes. Strip away those clothes, we stand naked, hardly better than a sheep. Sheep die day after day, and people too perish every day."
    },
    "1931": {
      "id": "f24ae1c7-0c56-4e15-bc0b-23291b765f9f",
      "title_chinese": "可笑世間人",
      "title": "How Laughable Are People",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "可笑世間人 癡多黠者少。不愁死路長 貪著苦煩惱。夜眠游鬼界 天曉歸人道。",
      "translation_english": "How laughable these worldly people are! So many fools, so few wise ones. They never worry about the long road to death, clinging greedily to their bitter troubles. They sleep at night drifting in ghosts’ realms, and at dawn return to human paths."
    },
    "1941": {
      "id": "8f6b907d-91c7-4f6d-b797-d8ba00452c5a",
      "title_chinese": "他家笑吾貧",
      "title": "They Mock My Poverty",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "他家笑吾貧 吾貧極快樂。無牛亦無馬 不愁賊抄掠。你富戶役高 差科並用卻。",
      "translation_english": "Others laugh at my poverty, but in it I find great joy. With no cows and no horses, I don’t worry about thieves. You rich folks serve higher powers and pay heavier taxes—it’s your trouble, not mine."
    },
    "1951": {
      "id": "d9e05e50-156a-4877-882b-64d2bde30ac8",
      "title_chinese": "大有愚癡君",
      "title": "The Greatly Foolish Man",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "大有愚癡君 獨身無兒子。廣貪多覓財 養奴多養婢。伺命門前喚 不容別鄰里。",
      "translation_english": "There’s a man awfully foolish, living alone, no children. Greedy for wealth, he gathers slaves and maidservants. He shouts orders at his door, leaving no room for neighborly kindness."
    },
    "1961": {
      "id": "ec77f833-6600-4143-b8e7-efb733ab9d9b",
      "title_chinese": "沉淪三惡道之一",
      "title": "Sinking into the Three Evil Realms (Part One)",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "沉淪三惡道 負特愚癡鬼。荒忙身卒死 即屬伺命使。反縛棒駈走 先渡奈河水。",
      "translation_english": "Sinking into the three evil realms, burdened by stupidity like a ghost. Frantic and foolish, you die suddenly, then belong to fate’s enforcers. Bound and driven with sticks, you must first cross the Naihe River."
    },
    "197": {
      "id": "82f0e4ab-5b5a-40f3-b727-7bda92516f9c",
      "title_chinese": "撩亂失精神",
      "title": "All in Disorder, Spirit Lost",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "撩亂失精神 無由見家裡。妻是他人妻 兒被後翁使。奴事新郎君 婢逐後娘子。",
      "translation_english": "In confusion you lose your spirit, never seeing your home again. Your wife becomes another man’s wife, your children serve a later master. Your slaves work for a new lord, and maids follow the next lady."
    },
    "198": {
      "id": "ea4d36be-819d-49ef-b4d5-51628b0cc14c",
      "title_chinese": "夫婦相對坐",
      "title": "Husband and Wife Face Each Other",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "夫婦相對坐 千年亦不足。一個病著床 遙看手不觸。正報到頭來 徒費將錢卜。",
      "translation_english": "A husband and wife sit facing each other; a thousand years together wouldn’t be enough. Then one falls ill, lying in bed, the other can only watch from afar, not able to reach out. When fate calls, all your money spent on fortune-telling does no good."
    },
    "199": {
      "id": "08b2ef72-f6da-47d4-acef-e4931e9e9c47",
      "title_chinese": "富者辦棺木",
      "title": "The Rich Prepare a Coffin",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "富者辦棺木 貧窮席裡角。相共唱奈何 送著空塚閣。千休即萬休 永別生平樂。",
      "translation_english": "The wealthy arrange for a coffin, the poor wrap themselves in a mat corner. They all chant ‘What can we do?’ and send the deceased off to an empty grave. End after end, forever parting from any earthly joy."
    },
    "200": {
      "id": "43c5c555-f021-4e2d-81da-5b7f27b1dffb",
      "title_chinese": "擎頭鄉里行",
      "title": "Walking Proudly in the Village",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "擎頭鄉里行 事當逞靴襖。有錢但著用 莫作千年調。",
      "translation_english": "Hold your head high as you walk through the village, strutting in boots and coat. If you’ve got money, go ahead and spend it. Don’t plan to hoard it for a thousand years."
    },
    "201": {
      "id": "8dc9e03f-5038-44b7-89ae-7d139c2d0847",
      "title_chinese": "百歲乃有一",
      "title": "A Hundred Years Rarely Come",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "百歲乃有一 人得七十稀。張眼看他死 不能自覺知。癡皮裹膿血 頑骨強相隨。",
      "translation_english": "A full hundred years is a rare thing; even seventy’s hard to reach. We watch others die with open eyes, never realizing our own turn’s near. Foolish flesh sacks filled with pus and blood, stubborn bones clinging stubbornly along."
    },
    "202": {
      "id": "2f7cbf85-b273-473e-914f-bd4adf14897c",
      "title_chinese": "雙盲不識鬼",
      "title": "Two Blind Men Don’t Know Ghosts",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "雙盲不識鬼 伺命急來追。赤繩串著項 反縛棒脊皮。露頭赤腳走 身上無衣被。",
      "translation_english": "Both blind, they don’t see the ghosts, yet fate’s messenger rushes forth. A red cord strung around their necks, backs whipped by sticks. Bare-headed, bare-footed, they run, no clothes to cover their bodies."
    },
    "203": {
      "id": "f4f7362a-04a0-4df7-b40d-d670f7fd8ae6",
      "title_chinese": "使者門前喚",
      "title": "The Messenger Calls at the Door",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "使者門前喚 忙怕不容遲。體逐他走 渾舍共號悲。宅舍無身護 妻子被人欺。",
      "translation_english": "The messenger shouts before your door, you scramble, no time to delay. Your body follows him away, the whole household wails in sorrow. With no one left to guard it, the home sees your wife and children bullied by others."
    },
    "204": {
      "id": "ce64f20b-1f8b-4449-9091-0e8c3278c28c",
      "title_chinese": "沉淪三惡道之二",
      "title": "Sinking into the Three Evil Realms (Part Two)",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "沉淪三惡道 家內無人知。有衣不能著 有馬不能騎。有奴不能使 有婢不相隨。",
      "translation_english": "Sinking into the three evil realms, no one at home even knows. You have clothes but cannot wear them, horses but cannot ride, slaves you cannot command, and maidservants who’ll never follow."
    },
    "205": {
      "id": "26e62efb-4fd9-42fb-8cbe-5b20792b089b",
      "title_chinese": "普勸諸貴等",
      "title": "A General Plea to the Esteemed",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "普勸諸貴等 火急造橋梁。運度身得過 福至生西方。",
      "translation_english": "A word to all the well-to-do: hurry and build a bridge to cross over safely. Earn the blessings that lead you west, toward the Pure Land."
    },
    "206": {
      "id": "83c145d0-b98e-4db6-899b-bb2d9054be32",
      "title_chinese": "告知賢貴等",
      "title": "A Message to the Worthy and Noble",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "告知賢貴等 各難知厭足。身是有限身 程期太劇促。縱得百年活 俳徊如轉燭。",
      "translation_english": "I tell you, good and noble ones: it’s hard to know contentment. The body’s limited, the journey too short. Even if you live a hundred years, it’s just spinning like a candle’s flame."
    },
    "207": {
      "id": "ab8fc1df-f1f3-4345-8963-b920d06f6632",
      "title_chinese": "傍看數個大憨癡",
      "title": "Watching a Few Utter Fools",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "傍看數個大憨癡 造舍擬作萬年期。人人百歲乃有一 縱令長命七十稀。",
      "translation_english": "Look at those big dull fools, building houses as if they’d last ten thousand years. A hundred-year life is one in a hundred, and even reaching seventy is rare indeed."
    },
    "208": {
      "id": "d0dfb4b4-82e2-4db2-8b68-9d92486eb58c",
      "title_chinese": "各各保愛膿血袋",
      "title": "Each Protects Their Pus and Blood Bag",
      "author_chinese": "王梵志",
      "author": "Wang Fanzhi",
      "content": "各各保愛膿血袋 一聚白骨帶頑皮。學他造罪身自誤 羨□□福是黠兒。",
      "translation_english": "Everyone cherishes this sack of pus and blood, a bunch of white bones wrapped in tough skin. By copying others, you burden yourself with sin. Envying others’ luck is the sign of a cunning fool."
    },
    "193": {
      "id": "193",
      "title_chinese": "孔子遊乎緇帷之林",
      "title": "Confucius Rambling in the Zi-Wei Forest",
      "author_chinese": "莊子",
      "author": "Zhuangzi",
      "content": "孔子遊乎緇帷之林 休坐乎杏壇之上。弟子讀書 孔子絃歌鼓琴 奏曲未半。有漁父者下船而來 須眉交白 被髮揄袂 行原以上 距陸而止 左手據膝 右手持頤以聽。",
      "content_english": "Confucius, rambling in the forest of Zi-wei, stopped and sat down by the Apricot altar. The disciples began to read their books, while he proceeded to play on his lute, singing as he did so. He had not half finished his ditty when an old fisherman stepped down from his boat, and came towards them. His beard and eyebrows were turning white; his hair was all uncombed; and his sleeves hung idly down.",
      "translation_english": "Confucius wandered through the forest’s dark curtains and took a quiet rest atop the Apricot Platform. His disciples read aloud while he strummed and sang, not yet halfway through his tune. A fisherman hopped off his boat and approached, white-bearded, hair loose, sleeves swaying. He climbed the gentle slope and halted on the bank, left hand on his knee, right hand at his chin, listening."
    },
    "194": {
      "id": "194",
      "title_chinese": "子貢還 報孔子",
      "title": "Zi-gong Returned, Reporting to Confucius",
      "author_chinese": "莊子",
      "author": "Zhuangzi",
      "content": "子貢還 報孔子。孔子推琴而起曰：「其聖人與！」乃下求之 至於澤畔 方將杖拏而引其船 顧見孔子 還鄉而立。",
      "content_english": "Zi-gong returned, and reported (what the man had said) to Confucius, who pushed his lute aside, arose, and said, 'Is he not a sage?' and down the slope he went in search of him. When he reached the edge of the lake, there was the fisherman with his pole, dragging the boat towards him. Turning round and seeing Confucius, he came back towards him and stood up.",
      "translation_english": "Zi-gong came back to tell Confucius what he had heard. Confucius put his lute down and stood, exclaiming, “Could that be a sage?” He went down the hillside until he reached the lakeside. The old fisherman was hauling his boat ashore, but when he saw Confucius, he turned and came back, standing before him."
    },
    "195": {
      "id": "195",
      "title_chinese": "同類相從 同聲相應",
      "title": "Like Seeks Like, Sounds Respond to Similar Notes",
      "author_chinese": "莊子",
      "author": "Zhuangzi",
      "content": "客曰：「同類相從 同聲相應 固天之理也。吾請釋吾之所有而經子之所以。子之所以者 人事也。",
      "content_english": "The stranger replied, 'Like seeks to like, and (birds) of the same note respond to one another - this is a rule of Heaven. Allow me to explain what I am in possession of, and to pass over (from its standpoint) to the things which occupy you. What you occupy yourself with are the affairs of men.'",
      "translation_english": "The guest said: “Those of like kind gather together, those with the same voice echo each other. This is Heaven’s principle. Let me set aside what I have and try to understand what guides you. What you’re caught up in are merely human affairs.”"
    },
    "196": {
      "id": "196",
      "title_chinese": "孔子再逐於魯",
      "title": "Confucius Twice Driven from Lu",
      "author_chinese": "莊子",
      "author": "Zhuangzi",
      "content": "孔子愀然而歎 再拜而起曰：「丘再逐於魯 削跡於衛 伐樹於宋 圍於陳、蔡。",
      "content_english": "Confucius looked sorrowful and sighed. He bowed twice, and then rose up and said, 'I was twice driven from Lu. I had to flee from Wei; the tree under which I rested was cut down in Song; I was kept in a state of siege between Chen and Cai.'",
      "translation_english": "Confucius grew somber, sighing deeply. After two respectful bows, he stood and said, “I, Qiu, was twice expelled from Lu, my presence erased in Wei, my resting tree chopped down in Song, and besieged between Chen and Cai.”"
    }
  }
  